<template>
  <div class="home">
    <div class="home__container d-flex flex-column align-center justify-center">
      <h2 class="mb-6">Тест пройти не хош, а?</h2>
      <p class="mb-6" plain>
        Я в своем познании настолько преисполнился, что я как будто бы уже сто
        триллионов миллиардов лет проживаю на триллионах и триллионах таких же
        планет, как эта Земля, мне этот мир абсолютно понятен, и я здесь ищу
        только одного - покоя, умиротворения и вот этой гармонии, от слияния с
        бесконечно вечным, от созерцания великого фрактального подобия и от вот
        этого замечательного всеединства существа, бесконечно вечного, куда ни
        посмотри, хоть вглубь - бесконечно малое, хоть ввысь - бесконечное
        большое, понимаешь? А ты мне опять со своим вот этим, иди суетись
        дальше, это твоё распределение, это твой путь и твой горизонт познания и
        ощущения твоей природы, он несоизмеримо мелок по сравнению с моим,
        понимаешь?
      </p>
      <v-btn variant="outlined">Ну чо на народ, погнали, нафиг!</v-btn>
    </div>
  </div>
</template>

<script>
import { defineComponent } from "vue";

export default defineComponent({});
</script>

<style lang="scss" scoped>
.home {
  max-width: 600px;
  margin: 0 auto;
  height: calc(100vh - 100px);
  overflow: hidden;

  &__container {
    height: 100%;
  }
}
</style>
